Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum
Polymesh check error result codes. See the PolymeshCheckerFlags to see how to set the various checks.

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.PolymeshLevelError
The vertex array contains vertices that are geometrically equivalent or
the polymesh contains unused vertices

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.PolymeshUndefined
Polymesh is null, the creation failed or unknown reasons.

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.PolymeshOk
Valid polymesh

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NumOfVerticesOuterloop
Number of vertices in outer loop too small

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NumOfVerticesInnerloop
Number of vertices in innerloop too small

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayOuterloop
Check of indices of vertices in outer loop failed

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayInnerloop
Check of indices of vertices in the innerloop failed

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.InnerloopNotInsideOuterloop
Inner loop is not inside the outer loop

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayForListOfEdges
Check of indices of vertices for edge list failed

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NonPlanarOuterloop
Outer loop points are not in the same plane with each other

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NonPlanarInnerloop
Inner loop points are not in the same plane with each other or with outer loop

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.SelfIntersectingOuterloop
Outer loop is self-intersecting

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.SelfIntersectingInnerloop
Inner loop is self-intersecting

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.LoopNormalsInvalid
Inner loop normal direction should be opposite to outer loop

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.FaceEdgesInvalidOrientation
Two neighbor faces with common edge have wrong orientation

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.FaceEdgesPartlyInvalidOrientation
Two neighbor faces with partly common edge have wrong orientation

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.MultishellPolymesh
Polymesh consists topologically of multiple shells

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.MultishellPolymeshByGeometry
Polymesh consists geometrically of multiple shells

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NumberOfFaces
Number of faces too small

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayUniqueness
The vertex array contains vertices that are geometrically equivalent

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexDuplicatesOnPolygon
The same vertex index appears at least twice for a face

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexCollinearOnPolygon
The face has at least one vertex that is collinear with others on an edge

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.NonManifoldEdges
The polymesh contains non-manifold edges

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.UnusedVertices
The polymesh contains unused vertices